### 1)

In [1]:
import pandas as pd

data = pd.Series([4, 8, 15, 16, 23,42])
data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### 2)

In [4]:
lst = ['s','u','r','y','a', 24,67,89,0.89,6.9]
data1 = pd.Series(lst)
data1

0       s
1       u
2       r
3       y
4       a
5      24
6      67
7      89
8    0.89
9     6.9
dtype: object

### 3)

In [5]:
df = pd.DataFrame([['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']], columns=['Name', 'Age', 'Gender'])
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### 4)

####  Pandas DataFrame is a widely used data structure which works with a two-dimensional array with labeled axes (rows and columns). DataFrame is defined as a standard way to store data that has two different indexes, i.e., row index and column index.

#### Series is defined as a one-dimensional array that is capable of storing various data types. The row labels of series are called the index. We can easily convert the list, tuple, and dictionary into series using "series' method.

In [7]:
# Series
df1 = pd.Series([1, 2, 3])

# Dataframe
df2 = pd.DataFrame([[2.7,4.9,6.8],[100,200,300],['A','B','C']])

In [9]:
df1

0    1
1    2
2    3
dtype: int64

In [10]:
df2

     0    1    2
0  2.7  4.9  6.8
1  100  200  300
2    A    B    C

### 5)

In [13]:
df3 = pd.DataFrame([[22,24,26],[87,78,66],['A','B','C']], columns = ['math','phy','chem'])
df3

  math phy chem
0   22  24   26
1   87  78   66
2    A   B    C

In [14]:
## Rename - column and index
df3.index=['one','two', 'three']
df3.columns=['phy','chem','math']
df3

      phy chem math
one    22   24   26
two    87   78   66
three   A    B    C

In [15]:
# Print first 2 dataset
df3.head(2)

    phy chem math
one  22   24   26
two  87   78   66

In [16]:
# Print last 2 dataset
df3.tail(2)

      phy chem math
two    87   78   66
three   A    B    C

### 6)

All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable.

> Series - Size Immutable, Values Mutable

> DataFrame - Size Mutable, Values Mutable

> Panel - Size Mutable, Values Mutable

### 7)

In [17]:
import pandas as pd

amount  = pd.Series(['1/2 middile sized', '1 tablespoon', '2 large', '1 teaspoon'])
ingredients  = pd.Series(['Onion', 'Oil', 'Eggs', 'Salt'])
print(type(amount), type(ingredients))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [20]:
pd.DataFrame([ingredients,amount])

                   0             1        2           3
0              Onion           Oil     Eggs        Salt
1  1/2 middile sized  1 tablespoon  2 large  1 teaspoon